#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_team.teams["TEST1"] will be created
  + resource "github_team" "teams" {
      + create_default_maintainer = false
      + description               = "生成検証"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "TEST1"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.teams["TEST2"] will be created
  + resource "github_team" "teams" {
      + create_default_maintainer = false
      + description               = "生成検証"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "TEST2"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.team_maintainers["TEST1-SHIRO-KAG"] will be created
  + resource "github_team_membership" "team_maintainers" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "SHIRO-KAG"
    }

  # github_team_membership.team_maintainers["TEST2-SHIRO-KAG"] will be created
  + resource "github_team_membership" "team_maintainers" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "SHIRO-KAG"
    }

  # github_team_membership.team_members["TEST1-AdachiShunta"] will be created
  + resource "github_team_membership" "team_members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "AdachiShunta"
    }

  # github_team_membership.team_members["TEST2-wakamatsuwakamatsu"] will be created
  + resource "github_team_membership" "team_members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "wakamatsuwakamatsu"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @SHIRO-KAG, Action: `pull_request`*